In [1]:
import pandas as pd

In [2]:
# Reading an Excel file
data = pd.read_excel("ESD.xlsx")
print(data)

# Note - If there is a large amount of data then it will show starting 5 records and the last 5 records

       EEID        Full Name                 Job Title  Department  \
0    E02387      Emily Davis                Sr. Manger          IT
1    E04105    Theodore Dinh       Technical Architect          IT
2    E02572     Luna Sanders                  Director     Finance
3    E02832  Penelope Jordan  Computer Systems Manager          IT
4    E01639        Austin Vo               Sr. Analyst     Finance
..      ...              ...                       ...         ...
995  E03094     Wesley Young               Sr. Analyst   Marketing
996  E01909     Lillian Khan                   Analyst     Finance
997  E04398      Oliver Yang                  Director   Marketing
998  E02521      Lily Nguyen               Sr. Analyst     Finance
999  E03545      Sofia Cheng            Vice President  Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0    Research & Development  Female      Black   55 2016-04-08         141604
1             Manufacturing    Male      Asian   59 1997-11-29          99975
2       Speciality Products  Female  Caucasian   50 2006-10-26         163099
3             Manufacturing  Female  Caucasian   26 2019-09-27          84913
4             Manufacturing    Male      Asian   55 1995-11-20          95409
..                      ...     ...        ...  ...        ...            ...
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country       City  Exit Date
0       0.15  United States    Seattle 2021-10-16
1       0.00          China  Chongqing        NaT
2       0.20  United States    Chicago        NaT
3       0.07  United States    Chicago        NaT
4       0.00  United States    Phoenix        NaT
..       ...            ...        ...        ...
995     0.00  United States   Columbus        NaT
996     0.00          China    Chengdu 2018-01-08
997     0.15  United States      Miami        NaT
998     0.00          China    Chengdu        NaT
999     0.31  United States      Miami        NaT

[1000 rows x 14 columns]

In [3]:
# Exploring data in pandas

print(data.head(10)) # to see n values from the starting.
print(data.tail(10)) # to see n values from the end.

# Note - for head() and tail() default values is 5.

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT
       EEID          Full Name             Job Title       Department  \
990  E01578       Anthony Hong            Sr. Manger               IT
991  E03430        Leo Herrera  Sr. Business Partner  Human Resources
992  E03058      Robert Wright   Technical Architect               IT
993  E04762  Audrey Richardson              Director               IT
994  E01148     Scarlett Kumar       Systems Analyst               IT
995  E03094       Wesley Young           Sr. Analyst        Marketing
996  E01909       Lillian Khan               Analyst          Finance
997  E04398        Oliver Yang              Director        Marketing
998  E02521        Lily Nguyen           Sr. Analyst          Finance
999  E03545        Sofia Cheng        Vice President       Accounting

              Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
990  Research & Development    Male      Asian   37 2010-11-29         146961
991  Research & Development    Male     Latino   48 1998-04-22          85369
992           Manufacturing    Male  Caucasian   30 2015-06-14          67489
993           Manufacturing  Female  Caucasian   46 2018-10-06         166259
994               Corporate  Female      Asian   55 2009-01-07          47032
995     Speciality Products    Male  Caucasian   33 2016-09-18          98427
996     Speciality Products  Female      Asian   44 2010-05-31          47387
997     Speciality Products    Male      Asian   31 2019-06-10         176710
998     Speciality Products  Female      Asian   33 2012-01-28          95960
999               Corporate  Female      Asian   63 2020-07-26         216195

     Bonus %        Country      City  Exit Date
990     0.11  United States  Columbus        NaT
991     0.00         Brazil    Manaus 2004-11-27
992     0.00  United States   Chicago        NaT
993     0.17  United States   Chicago        NaT
994     0.00  United States  Columbus        NaT
995     0.00  United States  Columbus        NaT
996     0.00          China   Chengdu 2018-01-08
997     0.15  United States     Miami        NaT
998     0.00          China   Chengdu        NaT
999     0.31  United States     Miami        NaT

In [4]:
# to know all the information related to our data like class, rangeIndex, total col, Non-Null count for every col, the datatype of col, memory usage, etc. 

print(data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 14 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   EEID           1000 non-null   object
 1   Full Name      1000 non-null   object
 2   Job Title      1000 non-null   object
 3   Department     1000 non-null   object
 4   Business Unit  1000 non-null   object
 5   Gender         1000 non-null   object
 6   Ethnicity      1000 non-null   object
 7   Age            1000 non-null   int64
 8   Hire Date      1000 non-null   datetime64[ns]
 9   Annual Salary  1000 non-null   int64
 10  Bonus %        1000 non-null   float64
 11  Country        1000 non-null   object
 12  City           1000 non-null   object
 13  Exit Date      85 non-null     datetime64[ns]
dtypes: datetime64[ns](2), float64(1), int64(2), object(9)
memory usage: 109.5+ KB
None

In [5]:
# It provides a quick overview of the statistical properties of the numerical columns in a DataFrame.
data.describe()

,Age,Hire Date,Annual Salary,Bonus %,Exit Date
count,1000.000000,1000,1000.000000,1000.000000,85
mean,44.382000,2012-04-07 02:54:14.400000,113217.365000,0.088660,2016-11-02 18:04:14.117647104
min,25.000000,1992-01-09 00:00:00,40063.000000,0.000000,1994-12-18 00:00:00
25%,35.000000,2007-02-14 00:00:00,71430.250000,0.000000,2014-12-25 00:00:00
50%,45.000000,2014-02-15 12:00:00,96557.000000,0.000000,2019-05-23 00:00:00
75%,54.000000,2018-06-22 00:00:00,150782.250000,0.150000,2021-04-09 00:00:00
max,65.000000,2021-12-26 00:00:00,258498.000000,0.400000,2022-08-17 00:00:00
std,11.246981,NaN,53545.985644,0.117856,NaN

In [6]:
# It provides a column-wise count of null values. 
print(data.isnull().sum())

EEID               0
Full Name          0
Job Title          0
Department         0
Business Unit      0
Gender             0
Ethnicity          0
Age                0
Hire Date          0
Annual Salary      0
Bonus %            0
Country            0
City               0
Exit Date        915
dtype: int64

In [7]:
# Handling duplicates using pandas

In [8]:
data = pd.read_csv('company1.csv')
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [9]:
# To show the count of all the existing duplicates.
print(data['EEID'].duplicated().sum())

2

In [10]:
# To show only duplicate records.
print(data[data['EEID'].duplicated(keep=False)])

    EEID    Name gender   salary
0  EMP01  ayushi      F      NaN
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [11]:
# To remove the duplicates. Always take col which must be having unique values to check for duplicates.
data_no_duplicates = data.drop_duplicates("EEID")
print(data_no_duplicates)
# Note - drop_duplicates() method does not modify the original Data in the CSV file directly. It creates a new DataFrame with the duplicates removed.

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

In [12]:
# To save the new data with no duplicates to existing or new file

# Save the DataFrame without duplicates back to a CSV file or Overwrite the original CSV file
data_no_duplicates.to_csv('company1_no_duplicates.csv', index=False)

In [13]:
# Working with missing data in pandas

# Handling Null values

In [15]:
data = pd.read_csv('company1.csv')
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [17]:
# NaN stands for "Not a Number." It is used to represent missing or undefined values in datasets.

print(data.isnull().sum())
print(data.isna().sum())

EEID      0
Name      1
gender    1
salary    2
dtype: int64
EEID      0
Name      1
gender    1
salary    2
dtype: int64

In [23]:
# Drop rows with any null values.

print(data.dropna())

    EEID    Name gender   salary
1  EMP02   rohit      M  25000.0
3  EMP01  ayushi      F  20000.0
6  EMP02   rohit      M  25000.0

In [24]:
# replacing or filling null values.

# fillna() method allows you to replace null values with a specified value

print(data.fillna(0))

    EEID      Name gender   salary
0  EMP01    ayushi      F      0.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      0  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05         0      M  25000.0
5  EMP06     rohit      M      0.0
6  EMP02     rohit      M  25000.0

In [27]:
# You can propagate the last valid observation forward or backward to fill null values.

print(data.fillna(method='ffill'))
print(data.fillna(method='bfill'))

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      M  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05    ayushi      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0
    EEID      Name gender   salary
0  EMP01    ayushi      F  25000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali      F  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05     rohit      M  25000.0
5  EMP06     rohit      M  25000.0
6  EMP02     rohit      M  25000.0

C:\Users\gupta\AppData\Local\Temp\ipykernel_2856\1931289420.py:3: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method='ffill'))
C:\Users\gupta\AppData\Local\Temp\ipykernel_2856\1931289420.py:4: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  print(data.fillna(method='bfill'))

In [31]:
# Use the replace() method to substitute null values with another value.

import numpy as np
data["salary"] = data['salary'].replace(np.nan,30000)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  30000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  30000.0
6  EMP02     rohit      M  25000.0

In [42]:
# Replace null values with statistical measures such as the mean, median, or mode of the column.

data = pd.read_csv('company1.csv')

salary_mean = data["salary"].mean()

data["salary"] = data['salary'].replace(np.nan,salary_mean)

print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24400.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24400.0
6  EMP02     rohit      M  25000.0

In [43]:
# Column transformation in pandas

In [46]:
data = pd.read_excel('ESD.xlsx')
print(data.head(10))

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date
0     0.15  United States    Seattle 2021-10-16
1     0.00          China  Chongqing        NaT
2     0.20  United States    Chicago        NaT
3     0.07  United States    Chicago        NaT
4     0.00  United States    Phoenix        NaT
5     0.00          China  Chongqing        NaT
6     0.10  United States    Phoenix        NaT
7     0.00  United States      Miami 2021-05-20
8     0.06  United States     Austin        NaT
9     0.00  United States    Chicago        NaT

In [53]:
# Create a get bonus column to populate values if emp is getting a bonus and not based on the bonus column.

data.loc[(data["Bonus %"] == 0),"Get Bonus"] = "NoBonus"
data.loc[(data["Bonus %"] > 0),"Get Bonus"] = "Bonus"

print(data.head(10))

# Note - data.loc[] is an accessor used for label-based indexing to Access rows and columns using labels, Filter rows based on boolean conditions,
# Modify values in the DataFrame.

     EEID        Full Name                 Job Title  Department  \
0  E02387      Emily Davis                Sr. Manger          IT
1  E04105    Theodore Dinh       Technical Architect          IT
2  E02572     Luna Sanders                  Director     Finance
3  E02832  Penelope Jordan  Computer Systems Manager          IT
4  E01639        Austin Vo               Sr. Analyst     Finance
5  E00644     Joshua Gupta    Account Representative       Sales
6  E01550      Ruby Barnes                   Manager          IT
7  E04332      Luke Martin                   Analyst     Finance
8  E04533    Easton Bailey                   Manager  Accounting
9  E03838  Madeline Walker               Sr. Analyst     Finance

            Business Unit  Gender  Ethnicity  Age  Hire Date  Annual Salary  \
0  Research & Development  Female      Black   55 2016-04-08         141604
1           Manufacturing    Male      Asian   59 1997-11-29          99975
2     Speciality Products  Female  Caucasian   50 2006-10-26         163099
3           Manufacturing  Female  Caucasian   26 2019-09-27          84913
4           Manufacturing    Male      Asian   55 1995-11-20          95409
5               Corporate    Male      Asian   57 2017-01-24          50994
6               Corporate  Female  Caucasian   27 2020-07-01         119746
7           Manufacturing    Male      Black   25 2020-05-16          41336
8           Manufacturing    Male  Caucasian   29 2019-01-25         113527
9     Speciality Products  Female  Caucasian   34 2018-06-13          77203

   Bonus %        Country       City  Exit Date Get Bonus
0     0.15  United States    Seattle 2021-10-16     Bonus
1     0.00          China  Chongqing        NaT   NoBonus
2     0.20  United States    Chicago        NaT     Bonus
3     0.07  United States    Chicago        NaT     Bonus
4     0.00  United States    Phoenix        NaT   NoBonus
5     0.00          China  Chongqing        NaT   NoBonus
6     0.10  United States    Phoenix        NaT     Bonus
7     0.00  United States      Miami 2021-05-20   NoBonus
8     0.06  United States     Austin        NaT     Bonus
9     0.00  United States    Chicago        NaT   NoBonus

In [61]:
data = pd.read_csv('MavenMarket_Customers.csv')
print(data.head(10))

   customer_id  customer_acct_num first_name  last_name  \
0            1        87462024688      Sheri     Nowmer
1            2        87470586299    Derrick    Whelply
2            3        87475757600     Jeanne      Derry
3            4        87500482201    Michael     Spence
4            5        87514054179       Maya  Gutierrez
5            6        87517782449     Robert    Damstra
6            7        87521172800    Rebecca   Kanagaki
7            8        87539744377        Kim    Brunner
8            9        87544797658     Brenda   Blumberg
9           10        87568712234     Darren      Stanz

         customer_address customer_city customer_state_province  \
0        2433 Bailey Road      Tlaxiaco                  Oaxaca
1      2219 Dewing Avenue         Sooke                      BC
2         7640 First Ave.      Issaquah                      WA
3           337 Tosca Way       Burnaby                      BC
4         8668 Via Neruda        Novato                      CA
5     1619 Stillman Court      Lynnwood                      WA
6  2860 D Mt. Hood Circle      Tlaxiaco                  Oaxaca
7       6064 Brodia Court    San Andres                      DF
8        7560 Trees Drive      Richmond                      BC
9         1019 Kenwal Rd.   Lake Oswego                      OR

   customer_postal_code customer_country  birthdate marital_status  \
0                 15057           Mexico  8/26/1961              M
1                 17172           Canada   7/3/1915              S
2                 73980              USA  6/21/1910              M
3                 74674           Canada  6/20/1969              M
4                 57355              USA  5/10/1951              S
5                 90792              USA  10/8/1942              S
6                 13343           Mexico  3/27/1949              M
7                 12942           Mexico  8/10/1922              M
8                 17256           Canada  6/23/1979              M
9                 82017              USA  8/26/1949              S

  yearly_income gender  total_children  num_children_at_home  \
0   $30K - $50K      F               4                     2
1   $70K - $90K      M               1                     0
2   $50K - $70K      F               1                     1
3   $10K - $30K      M               4                     4
4   $30K - $50K      F               3                     0
5   $70K - $90K      F               3                     0
6   $30K - $50K      F               2                     1
7   $50K - $70K      M               2                     2
8   $10K - $30K      M               5                     3
9   $30K - $50K      M               4                     0

             education acct_open_date member_card      occupation homeowner
0  Partial High School      9/10/1991      Bronze  Skilled Manual         Y
1  Partial High School      3/11/1993      Bronze    Professional         N
2     Bachelors Degree      6/11/1991      Bronze    Professional         Y
3  Partial High School      5/21/1994      Normal  Skilled Manual         N
4      Partial College      8/21/1992      Silver          Manual         N
5     Bachelors Degree       4/5/1992      Bronze    Professional         Y
6  Partial High School       5/1/1991      Bronze          Manual         Y
7     Bachelors Degree      6/11/1992      Bronze    Professional         Y
8  Partial High School     11/14/1993      Normal  Skilled Manual         Y
9     Bachelors Degree       5/4/1993      Golden      Management         N

In [66]:
# Create a column FUll name from existing columns first_name and Last_name and capitalize both columns

data['Full Name'] = data['first_name'].str.capitalize() + ' ' +  data['last_name'].str.capitalize()
print(data.head(10))

   customer_id  customer_acct_num first_name  last_name  \
0            1        87462024688      Sheri     Nowmer
1            2        87470586299    Derrick    Whelply
2            3        87475757600     Jeanne      Derry
3            4        87500482201    Michael     Spence
4            5        87514054179       Maya  Gutierrez
5            6        87517782449     Robert    Damstra
6            7        87521172800    Rebecca   Kanagaki
7            8        87539744377        Kim    Brunner
8            9        87544797658     Brenda   Blumberg
9           10        87568712234     Darren      Stanz

         customer_address customer_city customer_state_province  \
0        2433 Bailey Road      Tlaxiaco                  Oaxaca
1      2219 Dewing Avenue         Sooke                      BC
2         7640 First Ave.      Issaquah                      WA
3           337 Tosca Way       Burnaby                      BC
4         8668 Via Neruda        Novato                      CA
5     1619 Stillman Court      Lynnwood                      WA
6  2860 D Mt. Hood Circle      Tlaxiaco                  Oaxaca
7       6064 Brodia Court    San Andres                      DF
8        7560 Trees Drive      Richmond                      BC
9         1019 Kenwal Rd.   Lake Oswego                      OR

   customer_postal_code customer_country  birthdate  ... yearly_income gender  \
0                 15057           Mexico  8/26/1961  ...   $30K - $50K      F
1                 17172           Canada   7/3/1915  ...   $70K - $90K      M
2                 73980              USA  6/21/1910  ...   $50K - $70K      F
3                 74674           Canada  6/20/1969  ...   $10K - $30K      M
4                 57355              USA  5/10/1951  ...   $30K - $50K      F
5                 90792              USA  10/8/1942  ...   $70K - $90K      F
6                 13343           Mexico  3/27/1949  ...   $30K - $50K      F
7                 12942           Mexico  8/10/1922  ...   $50K - $70K      M
8                 17256           Canada  6/23/1979  ...   $10K - $30K      M
9                 82017              USA  8/26/1949  ...   $30K - $50K      M

  total_children  num_children_at_home            education acct_open_date  \
0              4                     2  Partial High School      9/10/1991
1              1                     0  Partial High School      3/11/1993
2              1                     1     Bachelors Degree      6/11/1991
3              4                     4  Partial High School      5/21/1994
4              3                     0      Partial College      8/21/1992
5              3                     0     Bachelors Degree       4/5/1992
6              2                     1  Partial High School       5/1/1991
7              2                     2     Bachelors Degree      6/11/1992
8              5                     3  Partial High School     11/14/1993
9              4                     0     Bachelors Degree       5/4/1993

  member_card      occupation homeowner         Full Name
0      Bronze  Skilled Manual         Y      Sheri Nowmer
1      Bronze    Professional         N   Derrick Whelply
2      Bronze    Professional         Y      Jeanne Derry
3      Normal  Skilled Manual         N    Michael Spence
4      Silver          Manual         N    Maya Gutierrez
5      Bronze    Professional         Y    Robert Damstra
6      Bronze          Manual         Y  Rebecca Kanagaki
7      Bronze    Professional         Y       Kim Brunner
8      Normal  Skilled Manual         Y   Brenda Blumberg
9      Golden      Management         N      Darren Stanz

[10 rows x 21 columns]

In [67]:
# Column transformation in pandas part 2

In [69]:
data = pd.read_csv('company1.csv')
data['salary'] = data['salary'].fillna(24000)
print(data)

    EEID      Name gender   salary
0  EMP01    ayushi      F  24000.0
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M  24000.0
6  EMP02     rohit      M  25000.0

In [70]:
# create a column bonus to give 20% bonus on salary

data['Bonus'] = (data['salary']/100)*20
print(data)

    EEID      Name gender   salary   Bonus
0  EMP01    ayushi      F  24000.0  4800.0
1  EMP02     rohit      M  25000.0  5000.0
2  EMP03  pranjali    NaN  27000.0  5400.0
3  EMP01    ayushi      F  20000.0  4000.0
4  EMP05       NaN      M  25000.0  5000.0
5  EMP06     rohit      M  24000.0  4800.0
6  EMP02     rohit      M  25000.0  5000.0

In [78]:
# create a column short month using the month column to populate the short name for the month.

month = {'Months':['January',' February', 'March', 'April']}
data = pd.DataFrame(month)

def extract_sliced_value(value):
    return value[0:3]

data['Short_Months'] = data['Months'].map(extract_sliced_value)

print(data)

# Note - we made a function for slicing the value and using the map method mapped the value to a new column

      Months Short_Months
0    January          Jan
1   February           Fe
2      March          Mar
3      April          Apr